driver-tests/bpelse/assign/predicatesJBI/test/TestCase3/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:esb="http://www.acme.co.nz/ESB">
  <soapenv:Body>
    <esb:activateService>
      <!--1 or more repetitions:-->
      <esb:objectNames test="test2">
        <esb:item>test2_string1</esb:item>
        <esb:item>test2_string2</esb:item>
    </esb:objectNames>
    </esb:activateService>
  </soapenv:Body>
</soapenv:Envelope>