driver-tests/bpelse/assign/predicatesJBI/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:esb="http://www.acme.co.nz/ESB">
  <soapenv:Body>
    <esb:activateService>
      <esb:objectNames>
        <esb:item>service</esb:item>
        <esb:item>resource</esb:item>
      </esb:objectNames>
    </esb:activateService>
  </soapenv:Body>
</soapenv:Envelope>